{"pageProps":{"post":{"slug":"devug-beginnings","featured":true,"title":"DevUG Beginnnings","date":"2011-01-12T00:00:00.000Z","card":{"content":"Coming out of the languages user group I helped found developer user group, aimed at bringing all developers together to learn from each other."},"intro":"<p> After a few months of running a programming languages user group with <a href=\"https://www.linkedin.com/in/markpearl/\">Mark Pearl</a> we started noticing a trend among developers. They were eager to learn from each other accross not only languages but in all things related to development. At the same time <a href=\"https://www.linkedin.com/in/macleanr\">Robert MacLean</a> was noticing the same thing. The 3 of us decided that we would close the languages user group and focus on building a community lead developer user group. For developers, by developers, with the aim of sharing knowledge accross boundaries to all developers. The <a href=\"https://www.meetup.com/DeveloperUG/\">DevUG</a> was born on 12 January 2006. 5 years already, wow! </p>","content":[{"type":"image","content":{"file":"Blog/highres_129013192.jpg","alt":"Photo from th first Developer User Group meetups."}},{"type":"html","content":"<p>We founded the group on a set of principles that still hold true today.</p> <ul> <li>We are run by the community, for the benefit of the community.</li> <li>The Developer User Group is a safe space and leads with inclusion and awareness of issues in the South African developer ecosystem.</li> <li>We are technology agnostic. This is a place for anyone involved in software to share about their technologies, practices and tools.</li> <li>We are vendor neutral. We do not support any vendor or company. While we do have sponsors, they do not dictate or influence the group in any way.</li> <li>We believe that collaboration and discussion offers everyone involved the opportunity to improve.</li> <li>The Developer User Group is a true non-profit organisation.</li> </ul> "}],"organisation":"Community","categories":["Software","Community"]}},"__N_SSG":true}