{"pageProps":{"post":{"slug":"driven-alliance","featured":true,"title":"Driven Alliance","date":"2016-08-04T00:00:00.000Z","card":{"content":"Leaving Driven was hard, I got to work with some of the best developers and if it wasn't for immigrating I would still be with them","image":{"file":"Blog/DrivenSoftwareLogo.png","alt":"Launching a weather balloon with the driven team"}},"intro":"<h2>Systems / Developer Coach</h2> <p> Working at Driven Alliance as a Systems Coach has given me a deep insight into organizational culture and how this can affect the effectiveness of a team. I firmly believe that all people are awesome and that their behavior is a reflection of the system they are in. At the same time its people that make up the system. I have been involved with multiple teams from an organizational and team level to help the team reach new levels of performance by focusing on flow. </p>","content":[{"type":"image","content":{"file":"Blog/IMG_7882.jpg","alt":"Launching a weather balloon with the driven team"}},{"type":"html","content":"<p>In most cases I find that software developers are treated as cogs in a machine that can be swapped out with another when not performing. This is a resource view of the world and while having great benefit in a low variability environment can be less that effective in the high variability environment that most software is written in. My challenge has been to have the conversations with all levels of the organization to see the benefits of optimizing for the flow of business value from idea to delivery. I have learnt to apply a level of systems thinking to problems to help teams, their managers and their peers to communicate better together while keeping their focus on the customer.</p> <p>In my role as a developer coach I have engaged with all team members to focus their solutions on being maintainable and scalable. From the tools that they use to the principles and practices behind using those tools. I have facilitated the architectural designs. My goal has been to have the whole team understand the customer’s problem and focus any decisions around solving it. There are many great tools out there and most of them work well. The question then is which will work for us. I believe that this is a higher-level discussion and when the team is involved in making that decision they will make it work.</p> <p>Being involved with multiple teams has given me the opportunity to triangulate my learning and see how every environment is unique.</p>"},{"type":"html","content":"<h2>Experience Gained</h2> <ul> <li> <p>2+ years Design and Development experience in:</p> <p>Practices:</p> <ul> <li> <p>Test Driven Development</p> </li> <li> <p>Scrum</p> </li> <li> <p>Kanban</p> </li> <li> <p>Systems Thinking</p> </li> <li> <p>Speaking at Conferences</p> </li> <li> <p>DevOps</p> </li> <li> <p>Retrospectives</p> </li> <li> <p>Facilitation</p> </li> </ul> <p>Languages:</p> <ul> <li> <p>Node (Javascript)</p> </li> <li> <p>Native Script (Javascript)</p> </li> <li> <p>Go (golang)</p> </li> <li> <p>Java</p> </li> <li> <p>C#</p> </li> </ul> <p>Tools:</p> <ul> <li> <p>Docker</p> </li> <li> <p>Git</p> </li> <li> <p>Teamcity</p> </li> <li> <p>GoCD (Continious Deliver Server)</p> </li> <li> <p>Kubernetes</p> </li> <li> <p>Many JavaScript frameworks and libraries</p> </li> <li> <p>AWS</p> </li> </ul> </li> </ul>"}],"organisation":"Driven Alliance","categories":["Software"]}},"__N_SSG":true}